Процедура ПересчетСтроки(ТекущаяСтрока, ПересчитатьСумму, Форма = Неопределено) Экспорт
	Если ПересчитатьСумму Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	Иначе
		Если ТекущаяСтрока.Количество <> 0 Тогда
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		Иначе
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма;
			ТекущаяСтрока.Количество = 1;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма <> Неопределено Тогда
		Форма.ОбновитьИтоги();
	КонецЕсли;
КонецПроцедуры