&НаКлиенте
Процедура ОбновитьИтоги() Экспорт
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбщегоНазначения.ПересчетСтроки(ТекущиеДанные, Истина, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбщегоНазначения.ПересчетСтроки(ТекущиеДанные, Истина, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбщегоНазначения.ПересчетСтроки(ТекущиеДанные, Ложь, ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПослеУдаления(Элемент)
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		ОбновитьИтоги();
	КонецЕсли;
КонецПроцедуры
